tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_SRC_MIX_SLICE.h
#define SRC_MIX_SLICE_FUNC_STAT_RST_STAT_MASK    (0x4U)
#define SRC_MIX_SLICE_FUNC_STAT_RST_STAT_SHIFT   (2U)
/*! RST_STAT - reset status
 *  0b0..reset asserted
 *  0b1..reset released
 */
#define SRC_MIX_SLICE_FUNC_STAT_RST_STAT(x)      (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_FUNC_STAT_RST_STAT_SHIFT)) & SRC_MIX_SLICE_FUNC_STAT_RST_STAT_MASK)

#define SRC_MIX_SLICE_FUNC_STAT_ISO_STAT_MASK    (0x10U)
#define SRC_MIX_SLICE_FUNC_STAT_ISO_STAT_SHIFT   (4U)
/*! ISO_STAT - isolation status
 *  0b0..isolation off
 *  0b1..isolation on
 */
#define SRC_MIX_SLICE_FUNC_STAT_ISO_STAT(x)      (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_FUNC_STAT_ISO_STAT_SHIFT)) & SRC_MIX_SLICE_FUNC_STAT_ISO_STAT_MASK)

#define SRC_MIX_SLICE_FUNC_STAT_EDGELOCK_HDSK_STAT_MASK (0x40U)
#define SRC_MIX_SLICE_FUNC_STAT_EDGELOCK_HDSK_STAT_SHIFT (6U)
/*! EDGELOCK_HDSK_STAT - Edgelock handshake status
 *  0b0..no effect or power up handshake with Edgelock done
 *  0b1..power down handshake with Edgelock done
 */
#define SRC_MIX_SLICE_FUNC_STAT_EDGELOCK_HDSK_STAT(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_FUNC_STAT_EDGELOCK_HDSK_STAT_SHIFT)) & SRC_MIX_SLICE_FUNC_STAT_EDGELOCK_HDSK_STAT_MASK)
/*! @} */

/*! @name UPI_STAT_0 - UPI Status 0 */
/*! @{ */

#define SRC_MIX_SLICE_UPI_STAT_0_UPI_ISO_REQUEST_MASK (0xFFFFU)
#define SRC_MIX_SLICE_UPI_STAT_0_UPI_ISO_REQUEST_SHIFT (0U)
/*! UPI_ISO_REQUEST - CPU mode transfer to trigger isolation change request of 16 domains */
#define SRC_MIX_SLICE_UPI_STAT_0_UPI_ISO_REQUEST(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_UPI_STAT_0_UPI_ISO_REQUEST_SHIFT)) & SRC_MIX_SLICE_UPI_STAT_0_UPI_ISO_REQUEST_MASK)

#define SRC_MIX_SLICE_UPI_STAT_0_UPI_EDGELOCK_HDSK_REQUEST_MASK (0xFFFF0000U)
#define SRC_MIX_SLICE_UPI_STAT_0_UPI_EDGELOCK_HDSK_REQUEST_SHIFT (16U)
/*! UPI_EDGELOCK_HDSK_REQUEST - CPU mode transfer to trigger Edgelock handshake request of 16 domains */
#define SRC_MIX_SLICE_UPI_STAT_0_UPI_EDGELOCK_HDSK_REQUEST(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_UPI_STAT_0_UPI_EDGELOCK_HDSK_REQUEST_SHIFT)) & SRC_MIX_SLICE_UPI_STAT_0_UPI_EDGELOCK_HDSK_REQUEST_MASK)
/*! @} */

/*! @name UPI_STAT_1 - UPI Status 1 */
/*! @{ */

#define SRC_MIX_SLICE_UPI_STAT_1_UPI_POWER_REQUEST_MASK (0xFFFFU)
#define SRC_MIX_SLICE_UPI_STAT_1_UPI_POWER_REQUEST_SHIFT (0U)
/*! UPI_POWER_REQUEST - CPU mode transfer to trigger power switch request of 16 domains */
#define SRC_MIX_SLICE_UPI_STAT_1_UPI_POWER_REQUEST(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_UPI_STAT_1_UPI_POWER_REQUEST_SHIFT)) & SRC_MIX_SLICE_UPI_STAT_1_UPI_POWER_REQUEST_MASK)

#define SRC_MIX_SLICE_UPI_STAT_1_UPI_RESET_REQUEST_MASK (0xFFFF0000U)
#define SRC_MIX_SLICE_UPI_STAT_1_UPI_RESET_REQUEST_SHIFT (16U)
/*! UPI_RESET_REQUEST - CPU mode transfer to trigger reset change request of 16 domains */
#define SRC_MIX_SLICE_UPI_STAT_1_UPI_RESET_REQUEST(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_UPI_STAT_1_UPI_RESET_REQUEST_SHIFT)) & SRC_MIX_SLICE_UPI_STAT_1_UPI_RESET_REQUEST_MASK)
/*! @} */

/*! @name LPM_SETTING_0 - Low Power Mode Setting 0 */
/*! @{ */

#define SRC_MIX_SLICE_LPM_SETTING_0_LPM_SETTING_CD_MASK (0x7U)
#define SRC_MIX_SLICE_LPM_SETTING_0_LPM_SETTING_CD_SHIFT (0U)
/*! LPM_SETTING_CD - LPM setting of current domain */
#define SRC_MIX_SLICE_LPM_SETTING_0_LPM_SETTING_CD(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_LPM_SETTING_0_LPM_SETTING_CD_SHIFT)) & SRC_MIX_SLICE_LPM_SETTING_0_LPM_SETTING_CD_MASK)
/*! @} */

/*! @name LPM_SETTING_1 - Low Power Mode Setting 1 */
/*! @{ */

#define SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D0_MASK (0x7U)
#define SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D0_SHIFT (0U)
/*! LPM_SETTING_D0 - LPM setting of domain 0
 *  0b000..Not used. Do not write this value.
 *  0b001..power on when domain n is in RUN, off in WAIT/STOP/SUSPEND
 *  0b010..power on when domain n is in RUN/WAIT, off in STOP/SUSPEND
 *  0b011..power on when domain n is in RUN/WAIT/STOP, off in SUSPEND
 *  0b100-0b111..power always on
 */
#define SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D0(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D0_SHIFT)) & SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D0_MASK)

#define SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D1_MASK (0x70U)
#define SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D1_SHIFT (4U)
/*! LPM_SETTING_D1 - LPM setting of domain 1
 *  0b000..Not used. Do not write this value.
 *  0b001..power on when domain n is in RUN, off in WAIT/STOP/SUSPEND
 *  0b010..power on when domain n is in RUN/WAIT, off in STOP/SUSPEND
 *  0b011..power on when domain n is in RUN/WAIT/STOP, off in SUSPEND
 *  0b100-0b111..power always on
 */
#define SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D1(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D1_SHIFT)) & SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D1_MASK)

#define SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D2_MASK (0x700U)
#define SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D2_SHIFT (8U)
/*! LPM_SETTING_D2 - LPM setting of domain 2
 *  0b000..Not used. Do not write this value.
 *  0b001..power on when domain n is in RUN, off in WAIT/STOP/SUSPEND
 *  0b010..power on when domain n is in RUN/WAIT, off in STOP/SUSPEND
 *  0b011..power on when domain n is in RUN/WAIT/STOP, off in SUSPEND
 *  0b100-0b111..power always on
 */
#define SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D2(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D2_SHIFT)) & SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D2_MASK)

#define SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D3_MASK (0x7000U)
#define SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D3_SHIFT (12U)
/*! LPM_SETTING_D3 - LPM setting of domain 3
 *  0b000..Not used. Do not write this value.
 *  0b001..power on when domain n is in RUN, off in WAIT/STOP/SUSPEND
 *  0b010..power on when domain n is in RUN/WAIT, off in STOP/SUSPEND
 *  0b011..power on when domain n is in RUN/WAIT/STOP, off in SUSPEND
 *  0b100-0b111..power always on
 */
#define SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D3(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D3_SHIFT)) & SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D3_MASK)

#define SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D4_MASK (0x70000U)
#define SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D4_SHIFT (16U)
/*! LPM_SETTING_D4 - LPM setting of domain 4
 *  0b000..Not used. Do not write this value.
 *  0b001..power on when domain n is in RUN, off in WAIT/STOP/SUSPEND
 *  0b010..power on when domain n is in RUN/WAIT, off in STOP/SUSPEND
 *  0b011..power on when domain n is in RUN/WAIT/STOP, off in SUSPEND
 *  0b100-0b111..power always on
 */
#define SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D4(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D4_SHIFT)) & SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D4_MASK)

